tutorials/untested/massFracCaseV1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    // (-0.19 -0.076 -0.076)
    // (0.00078  -0.076 -0.076)
    // (0.00078   0.076 -0.076)
    // (-0.19  0.076 -0.076)
    // (-0.19 -0.076 0.076)
    // (0.00078  -0.076 0.076)
    // (0.00078   0.076 0.076)
    // (-0.19  0.076 0.076)
    
    (0 0 0)
    (0.02  0 0)
    (0.02   0.002 0)
    (0  0.002 0)
    (0 0  0.002)
    (0.02  0  0.002)
    (0.02   0.002  0.002)
    (0  0.002  0.002)

    // (-0.06 -0.016 -0.016)
    // (-0.04  -0.016 -0.016)
    // (-0.04   0.016 -0.016)
    // (-0.06  0.016 -0.016)
    // (-0.06 -0.016  0.016)
    // (-0.04  -0.016  0.016)
    // (-0.04   0.016  0.016)
    // (-0.06  0.016  0.016)

    // (-0.01 -0.016 -0.016)
    // ( 0.01  -0.016 -0.016)
    // ( 0.01   0.016 -0.016)
    // (-0.01  0.016 -0.016)
    // (-0.01 -0.016  0.016)
    // ( 0.01  -0.016  0.016)
    // ( 0.01   0.016  0.016)
    // (-0.01  0.016  0.016)

    // (-0.05 -0.076 -0.076)
    // (0.00078  -0.076 -0.076)
    // (0.00078   0.001 -0.076)
    // (-0.05  0.001 -0.076)
    // (-0.05 -0.076 0.076)
    // (0.00078  -0.076 0.076)
    // (0.00078   0.001 0.076)
    // (-0.05  0.001 0.076)
);

blocks
(
//    hex (0 1 2 3 4 5 6 7) (200 100 100) simpleGrading (1 1 1)
//    hex (0 1 2 3 4 5 6 7) (165 50 50) simpleGrading (1 1 1)
//    hex (0 1 2 3 4 5 6 7) (200 60 60) simpleGrading (1 1 1)
//    hex (0 1 2 3 4 5 6 7) (40 60 60) simpleGrading (1 1 1)
  hex (0 1 2 3 4 5 6 7) (150 30 30) simpleGrading (1 1 1)
//   hex (0 1 2 3 4 5 6 7) (80 22 22) simpleGrading (1 1 1)
//    hex (0 1 2 3 4 5 6 7) (200 60 60) simpleGrading (1 1 1)
//    hex (0 1 2 3 4 5 6 7) (90 141 141) simpleGrading (1 1 1)
    // hex (0 1 2 3 4 5 6 7) (20 25 25) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
            
        );
    }
    cylinder
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
